function solution(fullText, searchText) {
    var count = 0;//თავიდან არის 0
    //ვნახულობთ 1ხელ მაინც თუ შეგვხვდება ესეთი სუბსტრინგი სტრინგში
    var index = fullText.indexOf(searchText, 0);
    //არ არსებობის შემთხვევაში მას მიენიჭება მნიშვნელობა-1
    //და ციკლი არ დაიწყება დაბრუნდება უნა 0 პირდაპირ
    //სხვა შემთხვევაში ციკლში შევა კოდი თუნდაც 1ხელ მაინც
    //რაც გამოიწვევს count-ის 1ით გაზრდას და პირველი 
    //აღმოჩენის დაფიქსირებას
    while (index !== -1) {
        count++;
        //შემდეგ ძებნას ჩაატარებს იმ ინდექსის შემდეგი ინდექსიდან
        //სადაც უკვე იპოვა ასეთი ქვე სტრინგი
        index = fullText.indexOf(searchText, index + 1);
    }
    return count;
}

solution('aa_bb_cc_dd_bb_e', 'bb') // აბრუნებს 2-ს რადგან bb გვხვდება 2ჯერ
solution('aaabbbcccc', 'bbb') // აბრუნებს 1-ს